Enums/СтатусыРасходныхОрдеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыРасходныхОрдеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтбору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПроверке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПроцессеПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проверен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СкладскиеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СкладскиеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратМатериаловИзПроизводстваОтгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНеПринятыхТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвижениеВФинансовомУчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускПродукцииВПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтборИзЯчеек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаВРозницу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаКомплектовДляРазборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаКомплектующихДляСборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаНаВнутренниеНужды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаПоВозвратуПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаПоПеремещению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеИзлишков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаПоПеремещениюВПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеНедостач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеПорчи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеРезультатовПересчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуПомещениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПроизводствоОтгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПроизводствоПриемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаПродукцииИзПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пересчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаКомплектующихПослеРазборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратМатериаловИзПроизводстваПриемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаПоВозвратуОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаПоПеремещению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаПоПрочемуОприходованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаПоПеремещениюВПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаПродукцииИзПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаСобранныхКомплектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеВЯчейки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНеПринятыхТоваровУстарел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПотреблениеМатериаловПриПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеМатериаловНаЗатраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркировкаПродукцииДляГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимодействиеСЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимодействиеСВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаТМЦВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеТМЦВЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеТМЦИзЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвентаризацияТМЦВЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованиеТМЦВЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимодействиеСЗЕРНО</Name>
					<Comment>Серии, попавшие в документы интеграции с ФГИС "Зерно"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимодействиеССАТУРН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РасходныйОрдерНаТоварыЛокализация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработка проверки заполнения. Проверка заполнения кодов маркировки  тольк осообщает о несоответсвии, 
// но НЕ блокирует обработку документа.
// 
// Параметры:
//  ЭтотОбъект - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  ПроверяемыеРеквизиты - Массив из Строка - Проверяемые реквизиты
Процедура ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Экспорт 
	
	//++ Локализация
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ОтказПроверки = Ложь;
	ПроверкаУникальностиМаркируемыхТоваров(ЭтотОбъект, ОтказПроверки);
	
	Если ОтказПроверки Тогда
		Возврат;
	КонецЕсли; 
	
	ПроверкаЗаполненияМаркируемойПродукции(ЭтотОбъект, ОтказПроверки);
	
	//-- Локализация
	
КонецПроцедуры

// Установить условное оформление.
// 
// Параметры:
//  ФормаДокумента - ФормаКлиентскогоПриложения -
Процедура УстановитьУсловноеОформление(ФормаДокумента) Экспорт

	//++ Локализация
	ИмяРеквизитаПодбораМП = "КоманднаяПанельПроверкаИПодборПродукцииГосИС";
	ИмяРеквизитаКолонкиСтатусаМП = "ОтгружаемыеТоварыСтатусПроверкиГосИС";
	
	Если ФормаДокумента.Элементы.Найти(ИмяРеквизитаПодбораМП) = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	//
	
	ФормаДокумента.Элементы[ИмяРеквизитаПодбораМП].Видимость = 
		СкладскиеОперацииДляПодбораИСМП().НайтиПоЗначению(ФормаДокумента.Объект.СкладскаяОперация) <> Неопределено;
		
	// 
	
	Если ФормаДокумента.Элементы.Найти(ИмяРеквизитаКолонкиСтатусаМП) = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Элемент = ФормаДокумента.УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаДокумента.Элементы[ИмяРеквизитаКолонкиСтатусаМП].Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СкладскаяОперация");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ОтборЭлемента.ПравоеЗначение = СкладскиеОперацииДляПодбораИСМП();
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	//-- Локализация
	
КонецПроцедуры

#Область МаркируемаяПродукция

// Определяет ведение учета маркируемой продукции.
// 
// Возвращаемое значение:
//  Булево - Используется маркируемая продукция
Функция ИспользуетсяМаркируемаяПродукция() Экспорт
	
	Возврат СкладыЛокализация.ИспользуетсяМаркируемаяПродукция();
	
КонецФункции

Процедура ЗаполнитьКешШтрихкодовУпаковок(Форма, Настройки = Неопределено, Инициализация = Ложь) Экспорт
	
	//++ Локализация
	Если Настройки = Неопределено Тогда
		Настройки = ПроверкаИПодборПродукцииИСМПУТ.НастройкиИсточникаКешаРасходногоОрдера();
	КонецЕсли;
	ПроверкаИПодборПродукцииИС.ЗаполнитьКешШтрихкодовУпаковок(Форма, Настройки, Инициализация);
	//-- Локализация
	
КонецПроцедуры

// Установить признак использования маркируемой продукции.
// 
// Параметры:
//  Форма - см. СкладыЛокализация.УстановитьПризнакИспользованияМаркируемойПродукции.Форма
Процедура УстановитьПризнакИспользованияМаркируемойПродукции(Форма) Экспорт
	
	СкладыЛокализация.УстановитьПризнакИспользованияМаркируемойПродукции(Форма);
	
КонецПроцедуры

// Определение признака маркируемая продукция текста запроса.
// 
// Параметры:
//  ПутьКПолюНоменклатура -Строка -Путь к полю номенклатура
// 
// Возвращаемое значение:
//  Строка - Определение признака маркируемая продукция текста запроса
Функция ОпределениеПризнакаМаркируемаяПродукцияТекстаЗапроса(ПутьКПолюНоменклатура) Экспорт
	
	Результат = "";
	//++ Локализация
	Результат = ИнтеграцияИСУТ.ОпределениеПризнакаМаркируемаяПродукцияТекстаЗапроса(ПутьКПолюНоменклатура);
	//-- Локализация
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область КонтрольЗаполнения

//++ Локализация

#Область КонтрольНоменклатурыПоРаспоряжениям

// Контроль товарного состава распоряжений. На текущий момент действует ограничение:
// одна номенклатурная позиция ордера может присутствовать только в одном распоряжении этого ордера.
// Параметры:
//	ЭтотОбъект - ДокументОбъект.РасходныйОрдерНаТовары
//	Отказ - Булево - возвращаемый параметр
Процедура ПроверкаУникальностиМаркируемыхТоваров(ЭтотОбъект, Отказ)
	
	Ошибки = Неопределено;
	
	КонтрольныеТипыДокументов = ТипыДокументовБезПовторенияТоваров();
	
	ИмяТаблицыТовары = "ТоварыПоРаспоряжениям";
	
	ОсобенностьУчета = Новый Массив;
	Для Каждого ВидПродукции Из ОбщегоНазначенияИСМП.ВидыПродукцииОбязательнойМаркировки() Цикл
		ОсобенностьУчета.Добавить(ИнтеграцияИСУТКлиентСервер.ОсобенностьУчетаПоВидуПродукции(ВидПродукции));
	КонецЦикла;
	Если Не ОсобенностьУчета.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросМаркируемыхТоваров = Новый Запрос;
	ЗапросМаркируемыхТоваров.УстановитьПараметр("Ссылка", ЭтотОбъект[ИмяТаблицыТовары].Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	ЗапросМаркируемыхТоваров.УстановитьПараметр("ОсобенностьУчета", ОсобенностьУчета);
	
	ЗапросМаркируемыхТоваров.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&Ссылка)
	|	И Номенклатура.ОсобенностьУчета В (&ОсобенностьУчета)";
	ПроверяемыеТовары = ЗапросМаркируемыхТоваров.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ПараметрыУказанияСерий = Документы[ЭтотОбъект.Ссылка.Метаданные().Имя].ПараметрыУказанияСерий(ЭтотОбъект)[ИмяТаблицыТовары];
	
	Для каждого ПроверяемыйТовар Из ПроверяемыеТовары Цикл
		
		ОтборПоТоварам = Новый Структура("Номенклатура",ПроверяемыйТовар);
		СтрокиТаблицы = ЭтотОбъект[ИмяТаблицыТовары].НайтиСтроки(ОтборПоТоварам);
		Для каждого СтрокаТовары Из СтрокиТаблицы Цикл
		
			ПроверитьСерии =
				Не НоменклатураКлиентСервер.ВЭтомСтатусеСерииНеУказываются(СтрокаТовары.СтатусУказанияСерий, ПараметрыУказанияСерий)
				И НоменклатураКлиентСервер.ВЭтомСтатусеСерииУказываютсяВТЧТовары(СтрокаТовары, ПараметрыУказанияСерий);
			ОтборПоПолям = ИнтеграцияИС.ПоляПоискаМаркируемойПродукции(ПроверитьСерии);
			ЗаполнитьЗначенияСвойств(ОтборПоПолям, СтрокаТовары);
			
			СтрокиТоваров = ЭтотОбъект[ИмяТаблицыТовары].НайтиСтроки(ОтборПоПолям);	// массив из СтрокаТабличнойЧасти
			ЗначимыеРаспоряжения = Новый Массив;
			Для каждого Элем Из СтрокиТоваров Цикл
				
				ТекРаспоряжение = Элем.Распоряжение;
				Если КонтрольныеТипыДокументов.Найти(ТипЗнч(ТекРаспоряжение)) = Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				
				Если ЗначимыеРаспоряжения.Найти(ТекРаспоряжение) = Неопределено Тогда
					ЗначимыеРаспоряжения.Добавить(ТекРаспоряжение);
				КонецЕсли; 
				
				Если ЗначимыеРаспоряжения.Количество() > 1 Тогда
					
					Шаблон = НСтр("ru = 'Одинаковый товар %1 в распоряжениях %2 и %3'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						Шаблон,
						Элем.Номенклатура,
						ЗначимыеРаспоряжения[0],
						ЗначимыеРаспоряжения[1]);
					
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
						Ошибки,
						СтрШаблон("Объект.%1[%%1].Распоряжение",ИмяТаблицыТовары),
						ТекстОшибки,
						"",
						Элем.НомерСтроки-1);
						
					ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
					
					Возврат;
		
				КонецЕсли;
				
			КонецЦикла; 
		
		КонецЦикла; 
	
	КонецЦикла; 
			
КонецПроцедуры

Функция ТипыДокументовБезПовторенияТоваров()

	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	
	Возврат ТипыДокументов;
	

КонецФункции // ТипыДокументовБезПовторенияТоваров()

#КонецОбласти 


#Область СопоставлениеКоличестваМарок
	
// Параметры:
//	ЭтотОбъект - ДокументОбъект.РасходныйОрдерНаТовары
//	Отказ - Булево
Процедура ПроверкаЗаполненияМаркируемойПродукции(ЭтотОбъект, Отказ)
	
	СтатусыКонтроля = СтатусыКонтроляМаркировки();
	СкладскиеОперацииКонтроля = СкладскиеОперацииКонтроляМаркировки(); 
	Если ТипЗнч(ЭтотОбъект) <> Тип("ДокументОбъект.РасходныйОрдерНаТовары")
		ИЛИ СкладскиеОперацииКонтроля.Найти(ЭтотОбъект.СкладскаяОперация) = Неопределено
		ИЛИ СтатусыКонтроля.Найти(ЭтотОбъект.Статус) = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ОбщегоНазначенияИСМП.ИспользуетсяМаркируемаяПродукция() Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыТоваров = Новый Структура;
	ПараметрыТоваров.Вставить("ИмяТаблицыТовары","ТоварыПоРаспоряжениям");
	ПараметрыТоваров.Вставить("ИмяПоляТовары","Номенклатура");
	ПараметрыТоваров.Вставить("ИмяПараметраУказанияСерий","ТоварыПоРаспоряжениям");
	ИнтеграцияИСУТ.ПроверитьЗаполнениеАкцизныхМарок(ЭтотОбъект,Отказ,,ПараметрыТоваров);
	
КонецПроцедуры

Функция СтатусыКонтроляМаркировки()
	
	СтатусыКонтроля = Новый Массив;
	СтатусыКонтроля.Добавить(Перечисления.СтатусыРасходныхОрдеров.Проверен);
	СтатусыКонтроля.Добавить(Перечисления.СтатусыРасходныхОрдеров.КОтгрузке);
	СтатусыКонтроля.Добавить(Перечисления.СтатусыРасходныхОрдеров.Отгружен);
	
	Возврат СтатусыКонтроля;
	
КонецФункции

Функция СкладскиеОперацииКонтроляМаркировки()

	СкладскиеОперацииКонтроля = Новый Массив;
	СкладскиеОперацииКонтроля.Добавить(Перечисления.СкладскиеОперации.КонтрольОтгрузки);
	СкладскиеОперацииКонтроля.Добавить(Перечисления.СкладскиеОперации.ОтгрузкаКлиенту);
	СкладскиеОперацииКонтроля.Добавить(Перечисления.СкладскиеОперации.ОтгрузкаВРозницу);
	
	Возврат СкладскиеОперацииКонтроля;
	
КонецФункции

Функция СкладскиеОперацииДляПодбораИСМП()

	Результат = Новый СписокЗначений;
	
	Результат.Добавить(Перечисления.СкладскиеОперации.ОтгрузкаКлиенту);
	Результат.Добавить(Перечисления.СкладскиеОперации.ОтгрузкаПоВозвратуПоставщику);
	
	Возврат Результат;

КонецФункции // СкладскиеОперацииДляПодбораИСМП()
 
#КонецОбласти 

//-- Локализация

#КонецОбласти

#КонецОбласти
